name: "SadTalker"
backend: "python"
max_batch_size: 0

input [
    {
        name: "source_image"
        data_type: TYPE_UINT8
        dims: [-1, -1, 3]
    },
    {
        name: "driven_audio"
        data_type: TYPE_FP32
        dims: [-1]
    }
]

output [
    {
    name: "frame_sizes"  
    data_type: TYPE_INT32
    dims: [-1]
    }

]


instance_group[
    {
        count: 2
        kind: KIND_GPU
    }
]